{
  "doc_name": "MSP Recovery Law Firm_Budget_FY26_P&L_DRAFT_v3.0.xlsx",
  "doc_description": "This document is a draft version of the budget for the fiscal year 2026 for MSP Recovery Law Firm, detailing the projected profit and loss statement. It includes a comprehensive breakdown of costs, expenses, and income over the year, organized by month and category.",
  "structure": [
    {
      "node_id": "0001",
      "title": "Consolidated",
      "summary": "The consolidated section provides an overview of the budget for MSP Recovery Law Firm for the fiscal year 2026. It includes detailed monthly projections for various accounts, including costs of goods sold, expenses, and net income.",
      "text": "The document outlines the budget for MSP Recovery Law Firm for FY26, with monthly breakdowns of costs and expenses. Key categories include Cost of Goods Sold, Expenses, and Net Income, with specific line items such as court costs, attorney fees, and payroll expenses.",
      "page_numbers": [
        1
      ],
      "nodes": [
        {
          "node_id": "0002",
          "title": "Cost of Goods Sold",
          "summary": "This section details the costs associated with goods sold by the firm, including court costs, case costs, and attorney fees. It provides monthly projections for each category.",
          "text": "Cost of Goods Sold includes court costs, case costs such as deposition and mediation fees, reproduction fees, transcript fees, and medical records. Attorney fees and process server costs are also detailed.",
          "page_numbers": [
            1
          ],
          "nodes": []
        },
        {
          "node_id": "0003",
          "title": "Expenses",
          "summary": "The expenses section outlines the general and administrative costs, business development, occupancy, professional fees, travel expenses, and payroll expenses. Each category is broken down into specific line items with monthly projections.",
          "text": "Expenses include general and administrative costs like bank service charges and insurance, business development expenses, occupancy costs such as rent and utilities, professional fees, travel expenses, and payroll expenses.",
          "page_numbers": [
            1
          ],
          "nodes": []
        },
        {
          "node_id": "0004",
          "title": "Other Income and Expenses",
          "summary": "This section covers other income and expenses, including gains or losses on asset sales and depreciation expenses. It provides a summary of these items, although no specific amounts are projected for FY26.",
          "text": "Other Income includes potential gains or losses on asset sales, while Other Expenses cover depreciation and reconciliation discrepancies. No amounts are projected for these categories in FY26.",
          "page_numbers": [
            1
          ],
          "nodes": []
        },
        {
          "node_id": "0005",
          "title": "Net Income",
          "summary": "The net income section calculates the total net income for each month by subtracting total expenses from total income. The document projects a negative net income for each month of FY26.",
          "text": "Total Net Income is calculated by subtracting total expenses from total income, resulting in a projected negative net income for each month of FY26.",
          "page_numbers": [
            1
          ],
          "nodes": []
        }
      ]
    }
  ],
  "_source_file": "MSP Recovery Law Firm_Budget_FY26_P&L_DRAFT_v3.0.xlsx",
  "_file_type": "xlsx",
  "_char_count": 10331,
  "_page_count": 1,
  "_has_page_images": false,
  "_doc_id": 6
}