{
  "doc_name": "5. Attestor-MSP - Amendment No. 1 to 2nd AR First Lien Credit Agreement.pdf",
  "doc_description": "This document is an amendment to the Second Amended and Restated Credit Agreement, involving multiple parties including Subrogation Holdings, LLC, MSP Recovery, LLC, and Hazel Partners Holdings LLC. The amendment primarily extends certain deadlines and reaffirms obligations under the existing credit agreement.",
  "structure": [
    {
      "node_id": "0001",
      "title": "Introduction and Parties Involved",
      "summary": "This section introduces the amendment to the Second Amended and Restated Credit Agreement, listing the parties involved, including the Borrower, Owner Pledgor, Mortgagor Parent, Mortgagor, Assignee, and Lender.",
      "text": "This AMENDMENT NO. 1 TO SECOND AMENDED AND RESTATED CREDIT AGREEMENT (this “Amendment”), dated as of December 15, 2023 (the “Effective Date”) is entered into by and among SUBROGATION HOLDINGS, LLC, a Delaware limited liability company (the “Borrower”), MSP RECOVERY, LLC, a Florida limited liability company (the “Owner Pledgor”), JRFQ HOLDINGS, LLC, a Delaware limited liability company (“Mortgagor Parent”), 4601 CORAL GABLES PROPERTY, LLC, a Florida limited liability company (“Mortgagor”), MSP RECOVERY CLAIMS, SERIES LLC – SERIES 15-09-321, a registered series of MSP Recovery Claims, Series LLC, a Delaware limited liability company, and a Subsidiary of the Borrower (the “Assignee”) and HAZEL PARTNERS HOLDINGS LLC, a Delaware limited liability company, as Lender (the “Lender”) and as Administrative Agent (in such capacity, the “Administrative Agent”).",
      "page_numbers": [
        1
      ]
    },
    {
      "node_id": "0002",
      "title": "Recitals and Purpose of Amendment",
      "summary": "The recitals explain the background and purpose of the amendment, which is to extend the delivery date for certain documents required by the existing credit agreement.",
      "text": "WHEREAS, the Borrower, the Owner Pledgor, the Assignee, the Lender and the Administrative Agent have entered into that certain Second Amended and Restated Credit Agreement, dated as of November 10, 2023 (the “Existing Credit Agreement”), pursuant to which Existing Credit Agreement, the Lenders agreed to make term loan facilities available to Borrower on the terms and conditions set forth therein; WHEREAS, the Borrower, the Owner Pledgor, the Mortgagor Parent, the Mortgagor, the Assignee, the Lender and the Administrative Agent wish to amend the Existing Credit Agreement to extend the date for the delivery of the Mortgage, the Policy and the Deed required by Section 7.21 of the Existing Credit Agreement, as more particularly described herein;",
      "page_numbers": [
        1
      ]
    },
    {
      "node_id": "0003",
      "title": "Amendments to the Credit Agreement",
      "summary": "This section details the specific amendments made to the existing credit agreement, including changes to the delivery dates in Sections 7.21 and 9.1(d).",
      "text": "1. Section 7.21 of the Existing Credit Agreement is hereby amended by replacing the date “December 15, 2023” in the first line thereof with the date “December 22, 2023”. 2. Section 9.1(d) of the Existing Credit Agreement is hereby amended by replacing the date “December 15, 2023” in the last line thereof with the date “December 22, 2023”.",
      "page_numbers": [
        1
      ]
    },
    {
      "node_id": "0004",
      "title": "Acknowledgments and Reaffirmations",
      "summary": "The parties acknowledge and consent to the amendment, reaffirming their obligations and liens under the credit documents.",
      "text": "Each of the Credit Parties hereby (a) acknowledges and consents to the execution and delivery of this Amendment, (b) agrees that this Amendment shall not limit or diminish the obligations of such Person arising under or pursuant to the Collateral Documents and the other Credit Documents to which it is a party effective immediately prior to the date hereof except to the extent expressly amended by this Amendment, and (c) reaffirms all of its obligations and Liens on any collateral which have been granted by it in favor of the Administrative Agent under the Credit Documents to which it is a party effective immediately prior to the date hereof.",
      "page_numbers": [
        1,
        2
      ]
    },
    {
      "node_id": "0005",
      "title": "General Provisions",
      "summary": "This section includes general provisions about the amendment, such as execution in counterparts, binding effect, and governing law.",
      "text": "This Amendment may be executed in counterparts, each of which shall constitute an original, but all of which when taken together shall constitute a single contract. Delivery of an executed counterpart of a signature page of this Amendment by electronic signature shall be effective as delivery of a manually executed counterpart. This Amendment shall be governed by, and construed in accordance with, the law of the State of New York.",
      "page_numbers": [
        2
      ]
    },
    {
      "node_id": "0006",
      "title": "Signatures",
      "summary": "The signature pages include the authorized signatures of the parties involved, confirming their agreement to the amendment.",
      "text": "IN WITNESS WHEREOF, the parties hereto have caused this Amendment to be duly executed and delivered by their respective officers thereunto duly authorized as of the date first written above.",
      "page_numbers": [
        3,
        4,
        5,
        6
      ]
    }
  ],
  "_source_file": "5. Attestor-MSP - Amendment No. 1 to 2nd AR First Lien Credit Agreement.pdf",
  "_file_type": "pdf",
  "_char_count": 6954,
  "_page_count": 6,
  "_has_page_images": true,
  "_doc_id": 29
}