{
  "doc_name": "22. Attestor-MSP - Subordinated Owner Security Agreement(204823856.1).pdf",
  "doc_description": "This document is a Subordinated Owner Security Agreement executed by MSP Recovery, LLC, for the benefit of Hazel Holdings I LLC, acting as the Administrative Agent for the Secured Party. It outlines the terms and conditions under which the Debtor grants a security interest in its assets to secure obligations under a Credit Agreement.",
  "structure": [
    {
      "node_id": "0001",
      "title": "Introduction and Recitals",
      "summary": "This section introduces the parties involved in the agreement, including MSP Recovery, LLC as the Debtor and Hazel Holdings I LLC as the Administrative Agent. It outlines the purpose of the agreement, which is to secure obligations under a Credit Agreement.",
      "text": "THIS SUBORDINATED OWNER SECURITY AGREEMENT (as amended, restated or supplemented, this \"Agreement\") is executed as of March __, 2023, by MSP RECOVERY, LLC, a Florida limited liability company (the \"Debtor\"), for the benefit of HAZEL HOLDINGS I LLC, a Delaware limited liability company, acting in its capacity as agent for the Secured Party...",
      "page_numbers": [
        1,
        2
      ]
    },
    {
      "node_id": "0002",
      "title": "Section 1: Certain Definitions",
      "summary": "This section provides definitions for key terms used throughout the agreement, such as 'Administrative Agent', 'Agreement', 'Collateral', and 'UCC'. It clarifies the meanings of these terms as they apply to the agreement.",
      "text": "Each capitalized term used but not defined in this Agreement has the meaning given that term in the Credit Agreement. If the definition given a term in Article 9 of the UCC conflicts with the definition given that term in any other chapter of the UCC, the Article 9 definition shall control...",
      "page_numbers": [
        2,
        3
      ]
    },
    {
      "node_id": "0003",
      "title": "Section 2: Lien",
      "summary": "This section describes the lien granted by the Debtor to the Administrative Agent on behalf of the Secured Party. It details the types of property included as Collateral and the conditions under which the lien is granted.",
      "text": "To secure the prompt, unconditional and complete payment and performance when due of both (i) the Obligations and (ii) the Guaranteed Obligations, the Debtor hereby grants to the Administrative Agent (on behalf of and for the benefit of the Secured Party), a lien on and continuing security interest in, all of the following property of the Debtor...",
      "page_numbers": [
        3,
        4
      ]
    },
    {
      "node_id": "0004",
      "title": "Section 3: Collateral Security; No Assumption or Modification",
      "summary": "This section clarifies that the Administrative Agent and the Secured Party do not assume any liabilities or obligations related to the Collateral. It emphasizes that the agreement does not modify the Debtor's obligations regarding the Collateral.",
      "text": "Neither the Administrative Agent nor the Secured Party assumes, nor shall the Administrative Agent or the Secured Party be liable for, the liabilities of the Debtor, duties or obligations under, or in connection with, the Collateral...",
      "page_numbers": [
        4
      ]
    },
    {
      "node_id": "0005",
      "title": "Section 4: Supplements; Further Assurances",
      "summary": "This section outlines the Debtor's obligations to take further actions and provide additional documentation to perfect and protect the security interest in the Collateral. It specifies the types of documents and actions required.",
      "text": "The Debtor shall at its sole expense take such further actions, and execute and/or deliver to the Administrative Agent such financing statements, amendments, assignments, agreements, notices, supplements, powers and instruments...",
      "page_numbers": [
        4,
        5
      ]
    },
    {
      "node_id": "0006",
      "title": "Section 5: Representations and Warranties",
      "summary": "The Debtor makes several representations and warranties to the Administrative Agent, including the accuracy of representations in the Credit Agreement and the authority to execute the agreement.",
      "text": "The Debtor represents and warrants to the Administrative Agent (on behalf of and for the benefit of the Secured Party) that: Each of the representations and warranties made by the Debtor in the Credit Agreement are true and correct...",
      "page_numbers": [
        5,
        6
      ]
    },
    {
      "node_id": "0007",
      "title": "Section 6: Covenants",
      "summary": "The Debtor agrees to certain covenants, including maintaining records of the Collateral, defending against claims, and not impairing the Collateral. These covenants are in place as long as the Credit Agreement is in effect.",
      "text": "The Debtor covenants and agrees with the Administrative Agent (on behalf of and for the benefit of the Secured Party) that so long as the Credit Agreement is in effect and thereafter until all Obligations and Guaranteed Obligations...",
      "page_numbers": [
        6,
        7
      ]
    },
    {
      "node_id": "0008",
      "title": "Section 7: Authorization to File Financing Statements",
      "summary": "The Debtor authorizes the Administrative Agent to file financing statements and amendments to perfect the security interest in the Collateral. The section specifies the information required for such filings.",
      "text": "The Debtor hereby irrevocably authorizes the Administrative Agent (on behalf of and for the benefit of the Secured Party) at any time and from time to time to file in any relevant jurisdiction any financing statements and amendments...",
      "page_numbers": [
        7
      ]
    },
    {
      "node_id": "0009",
      "title": "Section 8: Event of Default; Remedies",
      "summary": "This section outlines the remedies available to the Administrative Agent upon an Event of Default, including taking possession of the Collateral, selling the Collateral, and applying proceeds to the Obligations.",
      "text": "Upon the occurrence and during the continuance of an Event of Default, upon sending a Courtesy Notice, the Administrative Agent may from time to time exercise in respect of the Collateral, in addition to the other rights and remedies...",
      "page_numbers": [
        8,
        9,
        10
      ]
    },
    {
      "node_id": "0010",
      "title": "Section 9: Power of Attorney",
      "summary": "The Debtor grants the Administrative Agent a power of attorney to take certain actions regarding the Collateral upon an Event of Default. This power is irrevocable and coupled with an interest.",
      "text": "Without limiting any other power of attorney granted pursuant to the Credit Agreement or the other Credit Documents, upon the occurrence and during the continuance of an Event of Default, the Debtor irrevocably and unconditionally appoints...",
      "page_numbers": [
        10,
        11
      ]
    },
    {
      "node_id": "0011",
      "title": "Section 10: Miscellaneous",
      "summary": "This section includes various miscellaneous provisions, such as the termination of the agreement, waiver of notice and claims, and governing law. It also addresses the subordination of the security interests.",
      "text": "This Agreement shall terminate upon full and final payment in cash of the Obligations and any Guaranteed Obligations (other than contingent obligations that have not been asserted in writing) owing to the Secured Party...",
      "page_numbers": [
        11,
        12,
        13,
        14,
        15,
        16
      ]
    }
  ],
  "_source_file": "22. Attestor-MSP - Subordinated Owner Security Agreement(204823856.1).pdf",
  "_file_type": "pdf",
  "_char_count": 53543,
  "_page_count": 18,
  "_has_page_images": true,
  "_doc_id": 43
}