{
  "doc_name": "7. Attestor-MSP - Amendment No. 2 to 2nd AR First Lien Credit Agreement.pdf",
  "doc_description": "This document is an amendment to the Second Amended and Restated Credit Agreement, involving multiple parties including Subrogation Holdings, LLC, MSP Recovery, LLC, and Hazel Partners Holdings LLC. It outlines changes to the existing credit agreement, specifically extending certain deadlines and reaffirming obligations.",
  "structure": [
    {
      "node_id": "0001",
      "title": "Introduction and Parties Involved",
      "summary": "This section introduces the amendment to the Second Amended and Restated Credit Agreement, listing the parties involved, including the Borrower, Owner Pledgor, Mortgagor Parent, Mortgagor, Assignee, and Lender.",
      "text": "This AMENDMENT NO. 2 TO SECOND AMENDED AND RESTATED CREDIT AGREEMENT (this 'Amendment'), dated as of December 22, 2023 (the 'Effective Date') is entered into by and among SUBROGATION HOLDINGS, LLC, a Delaware limited liability company (the 'Borrower'), MSP RECOVERY, LLC, a Florida limited liability company (the 'Owner Pledgor'), JRFQ HOLDINGS, LLC, a Delaware limited liability company ('Mortgagor Parent'), 4601 CORAL GABLES PROPERTY, LLC, a Florida limited liability company ('Mortgagor'), MSP RECOVERY CLAIMS, SERIES LLC – SERIES 15-09-321, a registered series of MSP Recovery Claims, Series LLC, a Delaware limited liability company, and a Subsidiary of the Borrower (the 'Assignee') and HAZEL PARTNERS HOLDINGS LLC, a Delaware limited liability company, as Lender (the 'Lender') and as Administrative Agent (in such capacity, the 'Administrative Agent').",
      "page_numbers": [
        1
      ]
    },
    {
      "node_id": "0002",
      "title": "Recitals",
      "summary": "The recitals provide background on the existing credit agreement and the need for this amendment, which aims to extend the delivery date for certain documents required by the agreement.",
      "text": "WHEREAS, the Borrower, the Owner Pledgor, the Assignee, the Lender and the Administrative Agent have entered into that certain Second Amended and Restated Credit Agreement, dated as of November 10, 2023, as amended by that certain Amendment No. 1 to Second Amended and Restated Credit Agreement (as amended, the 'Existing Credit Agreement'), pursuant to which Existing Credit Agreement, the Lenders agreed to make term loan facilities available to Borrower on the terms and conditions set forth therein; WHEREAS, the Borrower, the Owner Pledgor, the Mortgagor Parent, the Mortgagor, the Assignee, the Lender and the Administrative Agent wish to amend the Existing Credit Agreement to extend the date for the delivery of the Mortgage, the Policy and the Deed required by Section 7.21 of the Existing Credit Agreement, as more particularly described herein;",
      "page_numbers": [
        1
      ]
    },
    {
      "node_id": "0003",
      "title": "Amendments to the Credit Agreement",
      "summary": "This section details the specific amendments to the credit agreement, including changes to the dates in Sections 7.21 and 9.1(d), and reaffirms the obligations of the parties involved.",
      "text": "1. Section 7.21 of the Existing Credit Agreement is hereby amended by replacing the date 'December 22, 2023' in the first line thereof with the date 'December 29, 2023'. 2. Section 9.1(d) of the Existing Credit Agreement is hereby amended by replacing the date 'December 22, 2023' in the last line thereof with the date 'December 29, 2023'. 3. Each of the Credit Parties hereby (a) acknowledges and consents to the execution and delivery of this Amendment, (b) agrees that this Amendment shall not limit or diminish the obligations of such Person arising under or pursuant to the Collateral Documents and the other Credit Documents to which it is a party effective immediately prior to the date hereof except to the extent expressly amended by this Amendment, and (c) reaffirms all of its obligations and Liens on any collateral which have been granted by it in favor of the Administrative Agent under the Credit Documents to which it is a party effective immediately prior to the date hereof.",
      "page_numbers": [
        1,
        2
      ]
    },
    {
      "node_id": "0004",
      "title": "General Provisions",
      "summary": "This section includes general provisions about the amendment, such as its non-novation nature, execution in counterparts, binding effect, and governing law.",
      "text": "5. Nothing herein contained shall be construed as a substitution or novation of any of the obligations outstanding under the Existing Credit Agreement or the other Credit Documents and shall continue on the terms thereof except as expressly amended by this Amendment. 6. This Amendment may be executed in counterparts, each of which shall constitute an original, but all of which when taken together shall constitute a single contract. Delivery of an executed counterpart of a signature page of this Amendment by electronic signature shall be effective as delivery of a manually executed counterpart. 7. This Amendment shall be binding upon and inure to the benefit of the parties hereto and their respective successors and permitted assigns pursuant to the terms of Section 12.5 of the Existing Credit Agreement 8. Any provision of this Amendment which is prohibited or unenforceable in any jurisdiction shall, as to such jurisdiction, shall be ineffective only to the extent of such prohibition or unenforceability without invalidating the remainder of such provision or the remaining provisions hereof or thereof or affecting the validity or enforceability of such provision in any other jurisdiction. 9. This Amendment shall be governed by, and construed in accordance with, the law of the State of New York.",
      "page_numbers": [
        2
      ]
    },
    {
      "node_id": "0005",
      "title": "Signatures",
      "summary": "The signature pages include the authorized signatures of the parties involved, confirming their agreement to the amendment.",
      "text": "IN WITNESS WHEREOF, the parties hereto have caused this Amendment to be duly executed and delivered by their respective officers thereunto duly authorized as of the date first written above. BORROWER: SUBROGATION HOLDINGS, LLC, a Delaware limited liability company By: Name: John H. Ruiz Title: Authorized Person OWNER PLEDGOR: MSP RECOVERY, LLC, a Florida limited liability company By: Name: John H. Ruiz Title: Authorized Person MORTGAGOR PARENT: JRFQ HOLDINGS, LLC, a Delaware limited liability company By: Name: John H. Ruiz Title: Authorized Person MORTGAGOR: 4601 CORAL GABLES PROPERTY, LLC, a Florida limited liability company By: Name: John H. Ruiz Title: Authorized Person GUARANTOR: MSP RECOVERY, LLC, a Florida limited liability company By: Name: John H. Ruiz Title: Authorized Person",
      "page_numbers": [
        3,
        4,
        5,
        6
      ]
    },
    {
      "node_id": "0006",
      "title": "Audit Trail",
      "summary": "The audit trail provides a record of the document's signing process, including timestamps and IP addresses.",
      "text": "Audit trail Title File name Document ID Audit trail date format Status Powered by Sign Sign Attestor-MSP - Amendment No. 2 to 2nd AR First Lien Credit... Attestor-MSP - Am...nt (MSP Exec).pdf ed22dd228254c4fa80e8980a83fc84f90f2c0128 DD / MM / YYYY Signed 13 / 02 / 2024 16:01:39 UTC Sent for signature to Christopher Guth (christopher.guth@attestorcapital.com) from ops@attestorcapital.com IP: 82.150.96.12 13 / 02 / 2024 16:16:26 UTC Viewed by Christopher Guth (christopher.guth@attestorcapital.com) IP: 161.123.227.242 13 / 02 / 2024 16:16:41 UTC Signed by Christopher Guth (christopher.guth@attestorcapital.com) IP: 82.150.96.12 The document has been completed. 13 / 02 / 2024 16:16:41 UTC",
      "page_numbers": [
        7
      ]
    }
  ],
  "_source_file": "7. Attestor-MSP - Amendment No. 2 to 2nd AR First Lien Credit Agreement.pdf",
  "_file_type": "pdf",
  "_char_count": 8065,
  "_page_count": 7,
  "_has_page_images": true,
  "_doc_id": 27
}